# See `brew leaves` and `brew bundle dump`

# Essentials
brew 'mas'
cask 'iterm2'
brew 'vim'	# Must be before macvim
cask 'macvim'

# Install packages
brew 'autoconf'
brew 'automake'
brew 'bash'
brew 'bash-git-prompt'
# brew 'bluetoothconnector'
# brew 'blueutil'
brew 'cmake'
# brew 'coreutils'
brew 'cscope'
brew 'curl'
brew 'diffr'
brew 'difftastic'
brew 'dos2unix'
brew 'get_iplayer'
brew 'gh'
brew 'gifsicle'
brew 'git'
brew 'git-delta'
brew 'git-extras'
brew 'git-lfs'
# brew 'git-subrepo'
brew 'gnupg'
brew 'gnuplot'
brew 'go'
brew 'gradle'
brew 'grc'
brew 'grep'
# brew 'hub'    # Mostly replace by 'gh'
brew 'jenv'
brew 'jq'
brew 'jupyterlab'
brew 'lesspipe'
# brew 'lsusb'
brew 'lnav'
brew 'lz4'
brew 'maven'
brew 'mercurial'
brew 'node'
brew 'p7zip'
brew 'pinentry-mac'
brew 'pngcrush'
brew 'pstree'
brew 'ruby'
brew 'sl'
brew 'source-highlight'
brew 'telnet'
brew 'tmux'
brew 'tree'
brew 'unar'
brew 'wget'
brew 'yarn'
brew 'youtube-dl'
brew 'yt-dlp'

tap 'aws/tap'
brew 'aws-sam-cli'
brew 'awscli'

# Completion packages
brew 'bash-completion@2'
brew 'brew-cask-completion'
brew 'bundler-completion'
brew 'docker-completion'
brew 'docker-compose-completion'
# Already part of docker-machine
# brew 'docker-machine-completion'
brew 'gem-completion'
brew 'maven-completion'
brew 'open-completion'
brew 'pip-completion'
brew 'rake-completion'
brew 'ruby-completion'

# Casks

cask '1password'
cask '1password-cli'
# cask 'alfred'
cask "apparency"
cask "audacity"
cask 'avibrazil-rdm'
cask 'backblaze'
cask 'bartender'
cask 'bbc-iplayer-downloads'
cask 'beyond-compare'
cask 'camtasia'
cask 'dash'
cask 'deepl'
cask 'discord'
cask 'dotnet-sdk'
cask 'dropbox'
cask 'epic-games'
cask "filemon"
cask 'fork'
cask 'freedome'
cask 'github'
cask 'google-chrome'
cask "google-drive"
cask "hot"
cask 'hyperswitch'
cask 'ilspy'
cask 'jd-gui'
cask 'jetbrains-toolbox'
cask 'logitech-presentation'
cask 'mcgimp'
cask 'mono-mdk'
cask 'onedrive'
# cask 'openemu'
cask "openemu-experimental"
cask 'openinterminal'
cask 'p4v'
# cask 'parallels'
cask 'pinta'
cask 'powershell'
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'quicklook-json'
cask "rocket"
cask 'shortcutdetective'
cask "signal"
cask 'simple-comic'
cask 'sizeup'
cask 'skype'
cask 'sloth'
cask 'spotify'
cask 'steam'
cask 'suspicious-package'
cask 'swish'
cask "the-unarchiver"
cask 'ukelele'
cask 'unity-hub'
cask 'visual-studio-code'
cask 'vlc'
cask "wireshark"
cask 'yacreader'
cask 'yed'
cask 'yourkit-java-profiler'

# Maybes
# cask 'anaconda'
# cask 'betterdisplay'
# cask 'bettertouchtool'
# cask 'dockview' # or 'dockmate' - replacing hyperdock
# cask 'gitkraken'
# cask 'krita'
# cask 'multitouch'
# cask 'qlstephen' # Extension-less files. Handled by iPreview?
# cask 'rar'
# cask 'rcdefaultapp'
# cask 'seashore'
# cask "skitch"
# cask 'tunnelblick'
# cask 'unshaky'
# cask "xquartz"

# Docker
# I always forget what docker component does what. This is probably not the best place for this, but meh.
# The docker cask installs Docker for Mac, aka Docker Desktop. This will install the command line tools on first run.
# /usr/local/bin/docker, docker-compose, docker-credential-desktop, docker-credential-osxkeychain
# Try `docker run -dp 80:80 docker/getting-started` and browsing to http://localhost
# Default docker vm is stored in ~/Library/Containers/com.docker.docker
# You can also use docker-machine with the docker-machine-parallels driver to host the docker vm in Parallels.
# This works, but requires extra setup to get docker talking to that host
cask 'docker'
# brew 'docker-machine'
# brew 'docker-machine-parallels'

# Dotnet SDK
tap 'isen-ng/homebrew-dotnet-sdk-versions'
cask "dotnet-sdk6-0-400"
cask "dotnet-sdk7-0-400"

# Fonts
tap 'homebrew/cask-fonts'
cask 'font-arial'
cask 'font-cascadia-code'
cask 'font-consolas-for-powerline'
cask 'font-fira-code'
cask 'font-hasklig'
cask "font-inter"
casl 'font-iosevka'
casl 'font-iosevka-aile'
casl 'font-iosevka-etoile'
casl 'font-iosevka-sparkle'
cask 'font-jetbrains-mono'
cask 'font-liberation-mono-for-powerline'
cask 'font-noto-sans-cjk-kr'
cask "font-open-sans"
cask 'font-roboto'
cask 'font-source-code-pro'
cask 'font-victor-mono'

tap 'colindean/fonts-nonfree'
cask 'font-microsoft-office'

# App Store - `mas list`
mas "1Password 7", id: 1333542190
mas 'DaisyDisk', id: 411643860
mas 'OneDrive', id: 823766827
mas 'Pocket', id: 568494494
mas 'Reeder', id: 1449412482
mas 'Shazam', id: 897118787
mas 'Slack', id: 803453959
mas 'Things', id: 904280696
mas 'WiFi Explorer Lite', id: 1408727408
# Takes too long, with no visible progress
# mas 'Xcode', id: 497799835

# Safari extensions
mas 'AdGuard for Safari', id: 1440147259
# mas 'AdBlock', id: 1402042596
# mas 'AdBlock Plus', id: 1432731683
# mas 'Ghostery Lite', id: 1436953057
# mas 'Minimal Consent', id: 1514164630
mas 'Save to Pocket', id: 1477385213
# mas 'Tab Space', id: 1473726602
mas 'Tampermonkey', id: 1482490089


# VS Code extensions
vscode "dfranx.shadered"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.dotnet-interactive-vscode"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "simplisticproductions.unity-logcat"
vscode "slevesque.shader"
vscode "vscodevim.vim"
